# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.
#
# List_1 = []
# List_2 = []
# n = int(input('Введите количество элементов первого множества: '))
# m = int(input('Введите количество элементов второго множества: '))
#
# print('Введите элементы первого множества')
# for i in range(n):
#     List_1.append(input(f'Элемент {i} = '))
#
# print('Введите элементы второго множества')
# for i in range(m):
#     List_2.append(input(f'Элемент {i} = '))
#
# List_3 = set(List_1 + List_2)
# List_3 = sorted(List_3)
# print(List_1, List_2, List_3)


# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке,
# причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло
# различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из
# управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
# # находясь перед некоторым кустом заданной во входном файле грядки.
# import random
# List = []
# count = []
# N = int(input('Введите количество кустов на грядке: '))
# for i in range(N):
#     List.append(random.randint(1, 10))
# print(List)
#
# for i in range(len(List) - 1):
#     count.append(List[i] + List[i -1] + List[i + 1])
# count.append(List[0] + List[i -1] + List[i - 2])
# print(count)
# print (max(count))